NEWS.org
#+OPTIONS: html-link-use-abs-url:nil html-postamble:t html-preamble:t
#+OPTIONS: html-scripts:t html-style:t html5-fancy:nil tex:t
#+HTML_DOCTYPE: xhtml-strict
#+HTML_CONTAINER: div
#+HTML_LINK_HOME: https://github.com/dieter-wilhelm/ansys-mode
#+HTML_LINK_UP: index.html
#+HTML_HEAD:
#+HTML_HEAD_EXTRA:
#+HTML_MATHJAX:
#+INFOJS_OPT:
#+CREATOR: <a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)
#+LATEX_HEADER:

#+STARTUP: showall
#+title: News and History of ANSYS-Mode

Copyright (C) 2006 - 2015  H. Dieter Wilhelm, GPL V3

** Version 16.1.1 July 2015

   - The command `ansys-show-command-parameters' (M-?) does
     additionally count the number of parameters and visualise at which
     parameter position the cursor currently is.  This tool-tip can now
     be switched off with a prefix argument of zero.

   - The command `ansys-send-to-ansys-and-proceed' (C-c C-j) is now
     interactive, i. e. after invoking this command with its
     key-sequence "C-c C-j" it can be repeated by typing just the
     final character "j" (or "C-j").  (This works from Emacs-24.4)

   - The command `ansys-send-to-ansys' (C-c C-c) grabs now the current
     paragraph, when there is no region marked.  And the cursor doesn't
     skip to the next code line without a prefix argument "C-u".

   - The output buffer *ANSYS* of the interpreter commands might now
     reside on a another Emacs frame.

   - switched on truncation of lines for ANSYS-Mode buffers, e. g. it is
     easier to read when there are many parameters in the
     ansys-show-parameter-help.

   - Extended the APDL material library which includes now creep and
     multi-linear plasticity data in matlib/ as well.

   - Is packaged with the current stable version Emacs-24.5 and updated
     for ANSYS 16.  Besides the Windows version there is also now a
     source package available for compiling Emacs-24.5 together with
     ANSYS-Mode.

   - Renamed README, NEWS and TODO to *.org, fontification.mac to
     example.mac.  Included an example.dat and example.anf

** Version 15.0.1 Aug 2014

   - Added an example of an ANSYS material library

   - C-c C-c (ansys-send-to-ansys) doesn't skip to the next code line any
     longer but remains in the code line. The former behaviour borrows
     the new function C-c C-j (ansys-send-to-ansys-and-proceed),
     executing and then skipping to the next code.

   - Improved the `ansys-show-blabla...

   - Highlighted now the parametric function CXABS(), which was already
     introduced in V14.

   - Updated the help, completion and highlighting functionality to V15
     And as usual: Corrected some bugs, typos and extended the templates,
     e. g. partial solutions with psolve for mass calculations.

** Version 14.5.2  Mar 2013

   - The unwieldy and usually uninteresting pure number blocks (the
     nblock, eblocks and cmblocks) in files with the suffix .dat are now
     hidden by default.  WorkBench creates these blocks in input files
     for the solver.  You can, off course, unhide these blocks and
     inspect them as well.

     Functions: `ansys-hide-number-blocks', `ansys-show-number-blocks',
     `ansys-hide-region'

     Customising variables: `ansys-hide-region-before-string',
     `ansys-hide-region-after-string' and
     `ansys-hide-region-propertize-markers'

   - Added a way for showing the current value and status of a user
     variable at point, overcoming the drawback of C-c C-v
     `ansys-display-variables' that it is showing only the variable
     definitions and definitions coming from external files are not
     shown. You can activate this functionality (Linux only) with a
     prefix argument: C-u C-c C-v.

   - Fixed the completion and highlighting of command keywords and their
     help entries, in the previous release were unfortunately many
     keywords missing or entries incomplete.

   - As always: Enhancements and corrections for the APDL templates,
     added a beam simulation template

** Version 14.5.1 Sep 2012

   - Added a function (C-c C-b or "M-x ansys-browse-ansys-help") showing
     the detailed ANSYS help in your web-browser for an APDL command or
     element name (also the element number is sufficient) around the
     cursor (or if that fails at the line beginning).

     Are you also tired of the ANSYS help browser?  For example try
     searching for the `F' APDL command, it is impossible! (update 2014:
     This has improved with the new help viewer in V15.) You have to pick
     it up from the alphabetical command list. Likewise when you are
     searching for an incomplete keyword, no hint, no completion,
     nothing!  Finding and browsing relevant APDL documentation is still
     cumbersome and too slow.

     As a highlight of this release you can now read immediately the
     detailed ANSYS help in your web browser for *all* APDL command AND
     element names around the cursor (or for the first command in the
     current line if that fails to be valid keyword).  You may input your
     search string also interactively, including its completion to ANSYS
     help keywords and of certain help categories, like `Release Notes'
     and such. This is an ideal complement to ANSYS-Mode's in-built
     `command syntax help'.

   - The function `ansys-start-ansys' is now available under Windows as well
     and starts the APDL product launcher under this platform.

   - When calling `ansys-browse-ansys-help' and
     `ansys-show-command-parameters' (M-? - the in-built `command syntax
     help') with a prefix argument for interactively entering a command
     name, the name is now completable.  And in the non-interactive mode
     both functions working also for APDL commands which are commented
     out as well (only for the first command in case of
     `ansys-show-command-parameters').

   - Also the input of `ansys-query-ansys-command' (C-c C-q) is now
     completable to all current ANSYS commands and with an optional
     prefix argument the current code line is copied as the initial
     input.

   - Improved the introductory and the in-depth tutorial and extended the
     documentation with an APDL and syntax highlighting reference in HTML
     and PDF. (To some degree syntax highlighted in the PDF version as
     well)

   - Values of the `_RETURN' variable are now documented in the function
     `ansys-skeleton-information'

   - `ansys-next-code-line' and `ansys-previous-code-line' (M-n, M-p) are
     now skipping over node and elements blocks, which are only pure
     number blocks.  They are now alternatives to
     `ansys-number-block-start' C-c { and C-c } respectively

   - Removed bug in customisation system and dropped 32 bit ANSYS support
     in line with the ANSYS OS
     [http://www.ansys.com/Support/Platform+Support strategy] for 2013.

   - Described a poor man's round() workaround in ansys-template-function
     under the nint() entry

