NEWS.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title></title>
<!-- 2015-06-23 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="H. Dieter Wilhelm" />
</head>
<body>
<div id="content">
<h1 class="title"></h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. News and History</a>
<ul>
<li><a href="#sec-1-1">1.1. Version 16.1.1 Mai 2015</a></li>
<li><a href="#sec-1-2">1.2. Version 15.0.1 Aug 2014</a></li>
<li><a href="#sec-1-3">1.3. Version 14.5.2  Mar 2013</a></li>
<li><a href="#sec-1-4">1.4. Version 14.5.1 Sep 2012</a></li>
<li><a href="#sec-1-5">1.5. Version 14.0.1 June 2012</a></li>
<li><a href="#sec-1-6">1.6. Version 13.0.1 March 2011</a></li>
<li><a href="#sec-1-7">1.7. Version 12.0.1 Dec 2010</a></li>
<li><a href="#sec-1-8">1.8. Version 11.0.2 Nov 2009</a></li>
<li><a href="#sec-1-9">1.9. ansys-mode.el 11.0.1 in comparison to ansys-mod.el:</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> News and History</h2>
<div class="outline-text-2" id="text-1">
<p>
Copyright (C) 2006 - 2015  H. Dieter Wilhelm, GPL V3
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Version 16.1.1 Mai 2015</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>The command `ansys-show-command-parameters' (M-?) does
additonally count the number of parameters and visualise at which
parameter position the cursor currently is.  This tooltip can now
be switched off with a prefix argument of zero.
</li>

<li>The command `ansys-send-to-ansy-and-proceed' (C-c C-j) is now
interactive, i. e. after invoking this command with its key-sequence
"C-c C-j" it can be repeated by typing just the final character "j"
(or "C-j").
</li>

<li>The command `ansys-send-to-ansys' (C-c C-c) grabs now the current
paragraph, when there is no region marked.  And the cursor doesn't
skip to the next code line without a prefix argument "C-u".
</li>

<li>The output buffer <b>ANSYS</b> of the interpreter commands might now
reside on a another Emacs frame.
</li>

<li>switched on truncation of lines for ANSYS-Mode buffers, e. g. it is
easier to read when there are many parameters in the
ansys-show-parameter-help.
</li>

<li>Extended the APDL material library which includes now creep and
multi-linear plasticity data in matlib/ as well.
</li>

<li>Is packaged with the current stable version Emacs-24.5 and updated
for ANSYS 16.  Besides the Windows version there is also now a
source package available for compiling Emacs-24.5 together with
ANSYS-Mode.
</li>

<li>Renamed README, NEWS and TODO to *.org, fontification.mac to
example.mac.  Included an example.dat and example.anf
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Version 15.0.1 Aug 2014</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Added an example of an ANSYS material library
</li>

<li>C-c C-c (ansys-send-to-ansys) doesn't skip to the next code line any
longer but remains in the code line. The former behaviour borrows
the new function C-c C-j (ansys-send-to-ansys-and-proceed),
executing and then skipping to the next code.
</li>

<li>Improved the `ansys-show-blabla&#x2026;
</li>

<li>Highlighted now the parametric function CXABS(), which was already
introduced in V14.
</li>

<li>Updated the help, completion and highlighting functionality to V15
And as usual: Corrected some bugs, typos and extended the templates,
e. g. partial solutions with psolve for mass calculations.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Version 14.5.2  Mar 2013</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li><p>
The unwieldy and usually uninteresting pure number blocks (the
nblock, eblocks and cmblocks) in files with the suffix .dat are now
hidden by default.  WorkBench creates these blocks in input files
for the solver.  You can, off course, unhide these blocks and
inspect them as well.
</p>

<p>
Functions: `ansys-hide-number-blocks', `ansys-show-number-blocks',
`ansys-hide-region'
</p>

<p>
Customisable variables: `ansys-hide-region-before-string',
`ansys-hide-region-after-string' and
`ansys-hide-region-propertize-markers'
</p>
</li>

<li>Added a way for showing the current value and status of a user
variable at point, overcoming the drawback of C-c C-v
`ansys-display-variables' that it is showing only the variable
definitions and definitions coming from external files are not
shown. You can activate this functionality (Linux only) with a
prefix argument: C-u C-c C-v.
</li>

<li>Fixed the completion and highlighting of command keywords and their
help entries, in the previous release were unfortunately many
keywords missing or entries incomplete.
</li>

<li>As always: Enhancements and corrections for the APDL templates,
added a beam simulation template
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Version 14.5.1 Sep 2012</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li><p>
Added a function (C-c C-b or "M-x ansys-browse-ansys-help") showing
the detailed ANSYS help in your web-browser for an APDL command or
element name (also the element number is sufficient) around the
cursor (or if that fails at the line beginning).
</p>

<p>
Are you also tired of the ANSYS help browser?  For example try
searching for the `F' APDL command, it is impossible! (update 2014:
This has improved with the new help viewer in V15.) You have to pick
it up from the alphabetical command list. Likewise when you are
searching for an incomplete keyword, no hint, no completion,
nothing!  Finding and browsing relevant APDL documentation is still
cumbersome and too slow.
</p>

<p>
As a highlight of this release you can now read immeadiately the
detailed ANSYS help in your web browser for <b>all</b> APDL command AND
element names around the cursor (or for the first command in the
current line if that fails to be valid keyword).  You may input your
search string also interactively, including its completion to ANSYS
help keywords and of certain help categories, like `Release Notes'
and such. This is an ideal complement to ANSYS-Mode's in-built
`command syntax help'.
</p>
</li>

<li>The function `ansys-start-ansys' is now available under Windows as well
and starts the APDL product launcher under this platform.
</li>

<li>When calling `ansys-browse-ansys-help' and
`ansys-show-command-parameters' (M-? - the in-built `command syntax
help') with a prefix argument for interactively entering a command
name, the name is now completable.  And in the non-interactive mode
both functions working also for APDL commands which are commented
out as well (only for the first command in case of
`ansys-show-command-parameters').
</li>

<li>Also the input of `ansys-query-ansys-command' (C-c C-q) is now
completable to all current ANSYS commands and with an optional
prefix argument the current code line is copied as the initial
input.
</li>

<li>Improved the introductory and the in-depth tutorial and extended the
documentation with an APDL and syntax highlighting reference in HTML
and PDF. (To some degree syntax highlighted in the PDF version as
well)
</li>

<li>Values of the `<sub>RETURN</sub>' variable are now documented in the function
`ansys-skeleton-information'
</li>

<li>`ansys-next-code-line' and `ansys-previous-code-line' (M-n, M-p) are
now skipping over node and elements blocks, which are only pure
number blocks.  They are now alternatives to
`ansys-number-block-start' C-c { and C-c } respectively
</li>

<li>Removed bug in customisation system and dropped 32 bit ANSYS support
in line with the ANSYS OS
[<a href="http://www.ansys.com/Support/Platform+Support">http://www.ansys.com/Support/Platform+Support</a> strategy] for 2013.
</li>

<li>Described a poor man's round() workaround in ansys-template-function
under the nint() entry
</li>
</ul>
</div>
</div>
