NEWS.org
** Version 14.0.1 June 2012

   - Enhanced the documentation, included is now an introductory tutorial
     `ansys-mode_tutorial.pdf' and a hands-on tutorial
     `APDL_tutorial.pdf'

   - Added a timer for getting rid of the parameter help overlays after
     some time interval (1 min) without reusing the parameter help

   - Added a (customisable) variable `ansys-no-of-processors' and
     function with the same name for specifying the number of processors
     for an Ansys multiprocessor run

   - Activated outline-minor-mode and auto-insertion (in default_el)

   - Extended mode commands, templates and removed typos mainly in
     ansys-template.el. For example added all *get functions in the
     ansys-skeleton-function template

   - Added a custom variable the corresponding function
     ansys-ansysli-servers for specifying the ansys interconnect license
     servers

   - Added a new shortcut and menu entry isometric view

   - Applied sensible defaults to ansys-lmutil-program, ansys-program and
     ansys-help-program, for most needs it should now be enough just to
     set the used ansys version (ansys-current-ansys-version, if it is
     not 140, see the example configuration file default_el) and maybe
     additionally the installation directory (ansys-install-directory).

** Version 13.0.1 March 2011

   - Added support for aligning whole sections of Ansys variable
     definitions, both in the Ansys menu and as a keyboard shortcut 'C-c
     C-a'

   - Enhanced ansys-display-skeleton with an optional argument for
     inserting the respective skeleton in the APDL buffer.

   - Enhanced some "interactive" code templates with lists for completing
     the input and sensible defaults

   - Refined some abbreviation definitions and focused the display of
     abbreviations to the mode specific ones

   - Fixed insert pair functions, like 'C-c %'

   - Changed keyboard shortcut for calling the Ansys help to 'C-c C-h'

   - Updated keyword list, deprecated elements, undocumented commands,
     etc. to release 13.0 of Ansys, as usual.

** Version 12.0.1 Dec 2010

   - Some new graphics commands like ansys-zoom-in, -zoom-out,
     -move-left, -right, -up, -down, etc.

   - The lisp code had to be split up for better maintenance, the code
     files for are now provided in an archive together with their
     compiled state for speed reasons.

   - Reworked the highlighting mainly for the sake of speed.  There are
     now highlighting levels to choose from, offering e. g. highlighting
     of deprecated element types in a warning-face, deprecated Ansys *
     comments and so on

   - Updated and improved the readability of the mode's help and the
     README file

   - The output from the LMUtil license status tool (C-c C-l) is now
     filtered on UNIX to be more concise.

   - The `ansys-send-to-ansys' (C-c C-c) and the ansys-copy-or-send-above
     (C-c C-u) commands are now generalised so that they are also doing
     some useful stuff without a running Ansys interpreter process (they
     copy in that case the cursor line/the chosen region and copy from
     the file beginning to the cursor line, respectively, to the
     clipboard).  Given a prefix argument to these commands, the cursor
     won't move to the next code line.

   - The completion of Ansys keywords is reworked and has improved.  Ansys
     symbols are now completed in 3 ways: Up-case, down-case and
     capitalise.

   - New: Added tool-tips to all Ansys menu entries.  Activated or
     deactivated menu entries according to the context

   - Ansys mode tries to gather information from the OS environment when
     the variable `ansys-license-file' is not set by the user and uses
     now Ansys standard names as default values for some more variables.

   - The variables in the variable summary are now sorted according to
     their first occurrence and not any longer in "definition types".  Now
     component names are included with the variable highlighting.

   - Added menu entry for reloading Ansys Mode for the case when certain
     customisation options in the code files itself are changed and
     require a code reloading to take effect.

   - Ansys mode changes some Emacs default behaviour to smooth the
     transition from other editors

** Version 11.0.2 Nov 2009

   - Enabled the preview of code templates or fragments (called
     skeletons in this mode, please inspect `ansys-display-skeleton').

   - Removed "buffer has no process" bug when killing an ansys-mode
     buffer.

   - Submitting interactively Ansys commands (via minibuffer query, not
     only as written in a macro file) to the solver process,
     ansys-query-ansys-command (C-c C-q).

