NEWS.html

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Version 14.0.1 June 2012</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Enhanced the documentation, included is now an introductory tutorial
`ansys-mode<sub>tutorial.pdf</sub>' and a hands-on tutorial
`APDL<sub>tutorial.pdf</sub>'
</li>

<li>Added a timer for getting rid of the parameter help overlays after
some time interval (1 min) without reusing the parameter help
</li>

<li>Added a (customisable) variable `ansys-no-of-processors' and
function with the same name for specifying the number of processors
for an Ansys multiprocessor run
</li>

<li>Activated outline-minor-mode and auto-insertion (in default<sub>el</sub>)
</li>

<li>Extended mode commands, templates and removed typos mainly in
ansys-template.el. For example added all *get functions in the
ansys-skeleton-function template
</li>

<li>Added a custom variable the corresponding function
ansys-ansysli-servers for specifying the ansys interconnect license
servers
</li>

<li>Added a new shortcut and menu entry isometric view
</li>

<li>Applied sensible defaults to ansys-lmutil-program, ansys-program and
ansys-help-program, for most needs it should now be enough just to
set the used ansys version (ansys-current-ansys-version, if it is
not 140, see the example config file default<sub>el</sub>) and maybe
additionally the installation directory (ansys-install-directory).
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> Version 13.0.1 March 2011</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>Added support for aligning whole sections of Ansys variable
definitions, both in the Ansys menu and as a keyboard shortcut 'C-c
C-a'
</li>

<li>Enhanced ansys-display-skeleton with an optional argument for
inserting the respective skeleton in the APDL buffer.
</li>

<li>Enhanced some "interactive" code templates with lists for completing
the input and sensible defaults
</li>

<li>Refined some abbreviation definitions and focused the display of
abbreviations to the mode specific ones
</li>

<li>Fixed insert pair functions, like 'C-c %'
</li>

<li>Changed keyboard shortcut for calling the Ansys help to 'C-c C-h'
</li>

<li>Updated keyword list, deprecated elements, undocumented commands,
etc. to release 13.0 of Ansys, as usual.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> Version 12.0.1 Dec 2010</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li>Some new graphics commands like ansys-zoom-in, -zoom-out,
-move-left, -right, -up, -down, etc.
</li>

<li>The lisp code had to be split up for better maintance, the code
files for are now provided in an archive together with their
compiled state for speed reasons.
</li>

<li>Reworked the fontification mainly for the sake of speed.  There are
now highlighting levels to choose from, offering e. g. higlighting
of deprecated element types in a warning-face, deprecated Ansys *
comments and so on
</li>

<li>Updated and improved the readability of the mode's help and the
README file
</li>

<li>The output from the LMUtil license status tool (C-c C-l) is now
filtered on UNIX to be more concise.
</li>

<li>The `ansys-send-to-ansys' (C-c C-c) and the ansys-copy-or-send-above
(C-c C-u) commands are now generalised so that they are also doing
some useful stuff without a running Ansys interpreter process (they
copy in that case the cursor line/the chosen region and copy from
the file beginning to the cursor line, respectively, to the
clipboard).  Given a prefix argument to these commands, the cursor
won't move to the next code line.
</li>

<li>The completion of Ansy keywords is reworked and has improved.  Ansys
symbols are now completed in 3 ways: Upcase, downcase and
capitalise.
</li>

<li>New: Added tooltips to all Ansys menu entries.  Activated or
deactivated menue entries according to the context
</li>

<li>Ansys mode tries to gather information from the OS environment when
the variable `ansys-license-file' is not set by the user and uses
now Ansys standard names as default values for some more variables.
</li>

<li>The variables in the variable summary are now sorted according to
their first occurance and not any longer in "definition types".  Now
component names are included with the variable highlighting.
</li>

<li>Added menu entry for reloading Ansys Mode for the case when certain
customisation options in the code files itself are changed and
require a code reloading to take effect.
</li>

<li>Ansys mode changes some Emacs default behaviour to smooth the
transition from other editors
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> Version 11.0.2 Nov 2009</h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li>Enabled the preview of code templates or fragments (called
skeletons in this mode, please inspect `ansys-display-skeleton').
</li>

<li>Removed "buffer has no process" bug when killing an ansys-mode
buffer.
</li>

<li>Submitting interactively Ansys commands (via minibuffer query, not
only as written in a macro file) to the solver process,
ansys-query-ansys-command (C-c C-q).
</li>
</ul>
</div>
</div>
