NEWS.org
** ansys-mode.el 11.0.1 in comparison to ansys-mod.el:

   - New: Provides Ansys command parameter- and syntax help.

   - New: Offers Ansys process management: Acquiring license server
     information in a buffer Starting and stopping asynchronously
     Ansys runs.  Sending code lines to running Ansys process (sort of
     code debugging facility) and getting the output into a buffer.

   - New: Experimental highlighting of user defined variables.
     Redefinition and clearing of variables is not yet taken into
     account.

   - New: Emacs customisation facility is available for the new Ansys
     mode group.

   - New: Emacs outline-minor-mode is readily available in conjunction
     with this mode.

   - Completions of Ansys commands are now case-sensitive, with
     additional completion of function and element names.

   - Previously defined skeletons are fully functional now, new ones
     are added and enabled with the abbreviation and auto-load
     facilities of Emacs 22.

   - Ansys' interpreter's disregard of any capitalisation is now fully
     taken into account in the highlighting.

   - The apostrophe "'" is now assigned as the Ansys string and the
     value of character parameters delimiter and not wrongly """;
     the strings are highlighted accordingly.

   - The dollar sign "$" is now emphasised as the Ansys condensed
     input character (multiple Ansys commands in one line).

   - The colon ":" is now emphasised as the Ansys colon do loop
     character ("(x:y:z)" means from x to y, in z steps, z is equal to
     one as default).  For example: "n,(1:6),(2:18:2)" runs 6 loops.
     Colon loops are working also with real values: k,,(2.5:3:0.1) and
     with array parameters: k,,A(1:100), but the latter is an
     undocumented feature. Since ansys 11.0 the colon looping is also
     working with *GET functions (example: A(1:5)=NX(1:5))). A ":"
     indicates also a beginning of a label for the *GO and *IF
     command.

   - "%" is now distinguished as the Ansys parameter substitution
     and format specifier character.

   - The ampersand "&" is now correctly highlighted as the only
     available Ansys continuation character applicable to the format
     commands (*MSG, *MWRITE, *VREAD and *VWRITE) command and the
     subsequent format strings of the command are highlighted.

   - New: " *" (<SPC> before `*') is indicated as an (Ansys deprecated)
     comment sign e. g.: %% a = 3 **4 %% results in "a" having the value
     3, whereas %% a = 3**4 %% sets "a" to 81!

   - New: A line beginning with a comma is indented to the length of the
     last non slash or asterisk command as a reminder that the Ansys
     solver interprets this as a space holder for the last command
     keyword (the Ansys default command concept).

   - Extended documentation, code cleaning and simplification of commands
     (e.g. comment handling) with the application of standard Emacs 22
     facilities among other things.

# The following is for Emacs
# local variables:
# word-wrap: t
# show-trailing-whitespace: t
# indicate-empty-lines: t
# end:
