NEWS.html

<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> ansys-mode.el 11.0.1 in comparison to ansys-mod.el:</h3>
<div class="outline-text-3" id="text-1-9">
<ul class="org-ul">
<li>New: Provides Ansys command parameter- and syntax help.
</li>

<li>New: Offers Ansys process management: Acquiring license server
information in a buffer Starting and stopping asynchronously
Ansys runs.  Sending code lines to running Ansys process (sort of
code debugging facility) and getting the output into a buffer.
</li>

<li>New: Experimental highlighting of user defined variables.
Redefinition and clearing of variables is not yet taken into
account.
</li>

<li>New: Emacs customisation facility is available for the new Ansys
mode group.
</li>

<li>New: Emacs outline-minor-mode is readily available in conjunction
with this mode.
</li>

<li>Completions of Ansys commands are now case-sensitive, with
additional completion of function and element names.
</li>

<li>Previously defined skeletons are fully functional now, new ones
are added and enabled with the abbreviation and auto-load
facilities of Emacs 22.
</li>

<li>Ansys' interpreter's disregard of any capitalisation is now fully
taken into account in the highlighting.
</li>

<li>The apostrophe "'" is now assigned as the Ansys string and the
value of character parameters delimiter and not wrongly """;
the strings are fontified accordingly.
</li>

<li>The dollar sign "$" is now emphasised as the Ansys condensed
input character (multiple Ansys commands in one line).
</li>

<li>The colon ":" is now emphasised as the Ansys colon do loop
character ("(x:y:z)" means from x to y, in z steps, z is equal to
one as default).  For example: "n,(1:6),(2:18:2)" runs 6 loops.
Colon loops are working also with real values: k,,(2.5:3:0.1) and
with array parameters: k,,A(1:100), but the latter is an
undocumented feature. Since ansys 11.0 the colon looping is also
working with *GET functions (example: A(1:5)=NX(1:5))). A ":"
indicates also a beginning of a label for the *GO and *IF
command.
</li>

<li>"%" is now distinguished as the Ansys parameter substitution
and format specifier character.
</li>

<li>The ampersand "&amp;" is now correctly highlighted as the only
available Ansys continuation character applicable to the format
commands (*MSG, *MWRITE, *VREAD and *VWRITE) command and the
subsequent format strings of the command are fontified.
</li>

<li>New: " *" (SPC before *) is indicated as an (Ansys deprecated)
comment sign e. g.: %% a = 3 **4 %% results in "a" having the value
3, whereas %% a = 3**4 %% sets "a" to 81!
</li>

<li>New: A line beginning with a comma is indented to the length of the
last non slash or asterisk command as a reminder that the Ansys
solver interprets this as a space holder for the last command
keyword (the Ansys default command concept).
</li>

<li>Extended documentation, code cleaning and simplification of commands
(e.g. comment handling) with the application of standard Emacs 22
facilities among other things.
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: H. Dieter Wilhelm (<a href="mailto:dieter@duenenhof-wilhelm.de">dieter@duenenhof-wilhelm.de</a>)</p>
<p class="date">Modification date: 2015-06-23 </p>
<p class="creator">Generated by <a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10) </p>
</div>
</body>
</html>
